src/load-generator/tests/retail-store-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: '{{ $processEnvironment.ARTILLERY_TARGET }}'
  phases:
    - duration: 15
      arrivalRate: 1
      rampTo: 3
      name: Warm up phase
    - duration: 30
      arrivalRate: 3
      rampTo: 5
      name: Ramp up load
    - duration: 15
      arrivalRate: 5
      rampTo: 10
      name: Spike phase
  engines:
      playwright: {}
  processor: ./scripts/flows.js
scenarios:
  - name: "Retail Store Basic Workflow"
    engine: playwright
    flowFunction: "retailStoreBasicWF"